/*
 Navicat MySQL Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50505
 Source Host           : localhost
 Source Database       : bd_news

 Target Server Type    : MySQL
 Target Server Version : 50505
 File Encoding         : utf-8

 Date: 06/05/2016 14:30:34 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `news`
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `catid` int(100) NOT NULL,
  `title` varchar(100) NOT NULL,
  `imgsrc` varchar(400) NOT NULL,
  `content` mediumtext NOT NULL,
  `date` date NOT NULL,
  `flag` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=174 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `news`
-- ----------------------------
BEGIN;
INSERT INTO `news` VALUES ('13', '2', '男士内裤3条装，49返现36，百度用户只要13元om/-fo3dSag_xI4khGko9WTAnF6hhy/super/pic/item/a7', 'https://ss3.baidu.com/-fo3dSag_xI4khGko9WTAnF6hhy/super/pic/item/a71ea8d3fd1f4134193b2fc0221f95cad1c85e7b.jpg', '男士内裤3条装，49返现36，百度用户只要13元', '2016-03-30', 'c'), ('14', '2', '飞机上女儿打翻了盘子，妈妈的反应把空姐惊呆了！很多父母看完感触颇深', 'http://img.mp.itc.cn/upload/20160328/177669bc356f492d8ca6d724235e40f3_th.jpg', '　6月17日，在从日本东京飞往美国加州圣何塞（San Jose）的飞机上，11岁的女儿和我刚刚用过午餐，那小小的餐桌上堆满了用过的餐巾纸、饮料杯、纸餐盘、饮料吸管等等，看上去一片狼藉。', '2016-03-30', 'c'), ('15', '2', '笔帽上的这个小孔能救命，90%的人不知道！', 'http://img.mp.itc.cn/upload/20160328/bfb74ad372154bd5b997c7b61f54cab7_th.jpg', '笔帽上的这个小孔能救命，90%的人不知道！', '2016-03-29', 'c'), ('16', '3', '32岁女子面如16岁少女 “冻龄”系颅咽管瘤作怪', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=569426603,4293405824&fm=80', '32岁女子面如16岁少女 “冻龄”系颅咽管瘤作怪', '2016-03-31', 'h'), ('17', '3', '传上海精子库告急捐精可获iPhone6s 官方回应', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=241465968,2867316128&fm=80', '传上海精子库告急捐精可获iPhone6s 官方回应', '2016-03-31', 'c'), ('18', '3', '　刘亦菲与宋承宪恋情曝光后引起热议，但却有媒体爆料称两人只是为新电影炒作造势，还有知情人称两人交往过，但其实已经分手', 'http://cnews.chinadaily.com.cn/img/attachement/jpg/site1/20160330/64006a47a3031865cc9219.jpg', '刘亦菲与宋承宪恋情曝光后引起热议，但却有媒体爆料称两人只是为新电影炒作造势，还有知情人称两人交往过，但其实已经分手。那么，刘亦菲和宋承宪的恋情究竟是怎么回事，宋承宪刘亦菲分手了吗?下面来看看。', '2016-03-31', 'c'), ('19', '3', '河正宇，这不是我们想要的许三观', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=421724045,1145660296&fm=80', '河正宇，这不是我们想要的许三观', '2016-03-31', 'c'), ('20', '3', '22绝代双骄》演员现状：燕南天身家330亿', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4283872653,71194647&fm=80', '绝代双骄》演员现状：燕南天身家330亿', '2016-03-31', 'c'), ('21', '3', 'Win10年度更新发布：功能全面升级', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=10492710,3770630083&fm=80', 'Win10年度更新发布：功能全面升级', '2016-03-31', 'c'), ('22', '3', '女孩独自爬山遇害 被发现时尸体半裸疑遭性侵', 'https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=251892715,2829815336&fm=80', '女孩独自爬山遇害 被发现时尸体半裸疑遭性侵', '2016-03-31', 'h'), ('23', '4', '济南小偷一日三餐吃泡面 为女主播一掷千金', 'http://h.hiphotos.baidu.com/image/h%3D200/sign=4e835c604dc2d562ed08d7edd71090f3/6609c93d70cf3bc768863fecd300baa1cd112a28.jpg', '济南小偷一日三餐吃泡面 为女主播一掷千金', '2016-03-31', 'f'), ('24', '4', '中国陆军电脑换装国产操作系统 都不用主机', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4283872653,71194647&fm=80', '中国陆军电脑换装国产操作系统 都不用主机', '2016-03-31', 'c'), ('25', '4', '微软主管表示：Win10免费升级请抓紧', 'http://img1.gtimg.com/news/pics/hv1/76/44/2047/133117471.jpg', '微软主管表示：Win10免费升级请抓紧', '2016-03-31', 'f'), ('26', '4', '记者暗拍吉林KTV：陪酒少女称给500元全脱', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=3290081333,2752996281&fm=80', '记者暗拍吉林KTV：陪酒少女称给500元全脱', '2016-03-31', 'c'), ('27', '4', '赞！魅族手机惊艳亮相联通终端交易会', 'http://i8.hexunimg.cn/2016-03-30/183050370.jpg', '交易会在重庆开幕。本次会议由中国联通携手重庆市政府举办，魅族科技（MEIZU）作为智能终端厂商应邀出席，向参展各方展示了智能手机、智能配件等产品，受到体验者们的称赞。', '2016-03-31', 'c'), ('28', '4', '赵丽颖农村出身学历低演技来凑 童年照被扒证未整容', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=691709336,2985208672&fm=80', '赵丽颖农村出身学历低演技来凑 童年照被扒证未整容', '2016-03-31', 'h'), ('29', '4', '《女汉子》票房逆袭夺冠 赵丽颖展惊人“圈粉”功力', ' https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=3145478109,3585230655&fm=80', '《女汉子》票房逆袭夺冠 赵丽颖展惊人“圈粉”功力', '2016-03-31', 'c'), ('30', '4', '张晋晒为贾静雯当替身旧照 一身女装模样青涩', 'http://y2.ifengimg.com/a/2016_14/2c2ceb5c662f499.jpg', '张晋晒为贾静雯当替身旧照 一身女装模样青涩', '2016-03-31', 'c'), ('31', '4', '拼了！宋小宝《喜剧人》变“美人鱼” 谢娜王祖蓝助阵', 'http://y1.ifengimg.com/cmpp/2016/03/30/11/a7236371-b668-4617-bce4-a409d01f812b_size87_w580_h387.jpg', '拼了！宋小宝《喜剧人》变“美人鱼” 谢娜王祖蓝助阵', '2016-03-31', 'f'), ('32', '1', '彭丽媛接待澳洲小学生 回答习大大忙不忙', 'http://y2.ifengimg.com/a/2016/0331/90481878388d60asize2547_w272_h480.gif', '2015年的初夏，幸福悄然而至。一群来自澳大利亚塔斯马尼亚州的孩子，第一次走进钓鱼台国宾馆，和“彭妈妈”面对面亲切聊天。对学习中文的他们来说，中国并不陌生。', '2016-03-31', 'c'), ('33', '1', '内蒙古原主席巴特尔调任国家民委主任(图/简历)', 'http://y3.ifengimg.com/a/2016_14/8a60ed9904917df.jpg', '据知情者透露，3月28日下午，国家民委召开干部大会，欢迎巴特尔主政国家民族事务委员会。', '2016-03-31', 'c'), ('34', '1', '陈光标视频回应“失联传闻”：手下传谣(图)', 'http://y1.ifengimg.com/a/2016_14/c99e19b44092215.jpg', '3月30日晚，素有“中国首善”之称的江苏黄埔再生资源利用有限公司董事长陈光标，被网传涉嫌诈骗被抓。', '2016-03-31', 'c'), ('35', '1', '太阳花女王”刘乔安被起诉', 'http://y2.ifengimg.com/a/2016_14/af32a3988bf9564.jpg', '中央社消息，太阳花女王刘乔安疑涉人口贩运去年遭检警约谈，台北地检署今天侦查终结，认定包括刘乔安在内的戴女、钟女等3人曾仲介他人赴国...', '2016-03-31', 'c'), ('36', '1', '包贝尔婚礼 柳岩遭伴郎团戏弄险被扔下水', 'http://img1.gtimg.com/ent/pics/hv1/253/125/2045/133008253_small.jpg', '包贝尔婚礼 柳岩遭伴郎团戏弄险被扔下水', '2016-03-31', 'c'), ('37', '1', '撒贝宁妻子身份成谜 所谓前夫真是外交人员？', 'http://img1.gtimg.com/ent/pics/hv1/134/88/2044/132933674_small.jpg', '撒贝宁妻子身份成谜 所谓前夫真是外交人员？', '2016-03-31', 'c'), ('38', '1', '窦靖童迪丽热巴张天爱……她们“攻”气十足', 'http://img1.gtimg.com/15/1561/156131/15613106_small.jpg', '窦靖童迪丽热巴张天爱……她们“攻”气十足', '2016-03-31', 'c'), ('39', '1', '御姐变身小清新 能看出这个清秀女生是秦海璐吗', 'http://img1.gtimg.com/ent/pics/hv1/14/61/2045/132991694.png', '御姐变身小清新 能看出这个清秀女生是秦海璐吗', '2016-03-31', 'c'), ('158', '3', '《女汉子》票房逆袭夺冠 赵丽颖展惊人“圈粉”功力', 'http://y2.ifengimg.com/a/2016_14/af32a3988bf9564.jpg', '窦靖童迪丽热巴张天爱……她们“攻”气十足', '2016-04-02', 'f'), ('159', '2', '《女汉子》票房逆袭夺冠 赵丽颖展惊人“圈粉”功力', 'http://y2.ifengimg.com/a/2016_14/2c2ceb5c662f499.jpg', '御姐变身小清新 能看出这个清秀女生是秦海璐吗', '2015-01-21', 'h'), ('161', '1', '习近平首论补齐党内制度短板', 'http://img1.gtimg.com/news/pics/hv1/178/15/2052/133435303.jpg', '习近平首论补齐党内制度短板', '2016-04-08', 'c'), ('162', '1', '多省养老保险等缴费比例将降 企⊙①?◎Θ⊙●○¤㊣㈱@の■□★☆◆◇href=\"#nav\" class=\"nav-toggle  \" aria-hidden=\"true\">Menu</a>', 'http://img1.gtimg.com/news/pics/hv1/57/237/2051/133426767.png', '多省养老保险等缴费比例将降 企业减负1000多亿', '2016-04-08', 'c'), ('163', '2', '萌翻！美摄影师将熟睡婴儿完美融入名画', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=3030109917,741983894&fm=80', '萌翻！美摄影师将熟睡婴儿完美融入名画', '2016-04-14', 'f'), ('164', '2', '南一高校情侣教室亲昵被偷拍 视频遭热传', 'https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=4136836459,1954522501&fm=80', '南一高校情侣教室亲昵被偷拍 视频遭热传', '2016-04-08', 'c'), ('165', '2', '包邮】稻源香大米5斤，38返现27，百度用户只要11元', 'https://ss0.baidu.com/94o3dSag_xI4khGko9WTAnF6hhy/vip/wh%3D176%2C106%3Bq%3D100/sign=080599b42af5e0feee4d81006b561899/ca1349540923dd54ae5431c5d609b3de9c82487c.jpg', '包邮】稻源香大米5斤，38返现27，百度用户只要11元', '2016-04-09', 'h'), ('166', '2', '疯狂动物城炒热宠物狐狸网售 小心花了冤枉钱！', 'https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=1574826112,1264564680&fm=80', '疯狂动物城炒热宠物狐狸网售 小心花了冤枉钱！', '2016-04-03', 'f'), ('167', '2', '新闻联播》王宁机智救场 李梓萌嘟嘴呆萌', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4242151737,2147689775&fm=80', '新闻联播》王宁机智救场 李梓萌嘟嘴呆萌', '2016-04-02', 'h'), ('168', '3', 'iOS新BUG很惊悚：连接WiFi瞬间变砖', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=1807969659,725970639&fm=80', 'iOS新BUG很惊悚：连接WiFi瞬间变砖', '2016-04-03', 'h'), ('169', '1', '男子发女友照片寻人 照中女子现身：我不是你女友', 'https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=2320056157,1702759597&fm=80', '男子发女友照片寻人 照中女子现身：我不是你女友', '2016-04-08', 'h'), ('170', '4', '900斤男子接受全身扫描 X光照片惊呆众人', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=3399291824,1163499691&fm=80', '900斤男子接受全身扫描 X光照片惊呆众人', '2016-04-08', 'h'), ('171', '4', '女子发现墙上多出一个怪洞：挖开后惊呆了', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1348846403,2831893276&fm=80', '女子发现墙上多出一个怪洞：挖开后惊呆了', '2016-04-05', 'h'), ('172', '4', '秦昊晒与伊能静自拍 女方素颜显憔悴', 'https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=2586521886,884048061&fm=80', '秦昊晒与伊能静自拍 女方素颜显憔悴', '2016-04-05', 'h'), ('173', '3', '玛莎拉蒂上被恶意刻字 车身上写“贱人”', 'https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1781563205,2836368910&fm=80', '玛莎拉蒂上被恶意刻字 车身上写“贱人”', '2016-04-08', 'h');
COMMIT;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `uid` mediumint(8) NOT NULL,
  `username` char(32) NOT NULL,
  `roled` int(8) NOT NULL,
  `password` char(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `user`
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES ('1', 'admin', '0', 'admin');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
